In [3]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]

series=pd.Series(data)

print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
data={'a':1,'b':1,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    1
c    3
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index)

a    10
b    20
c    30
dtype: int64

In [8]:
## Dataframe
## create a Dataframe from a dictionary oof list

data={
    'Name':['salman','akhtar'],
    'Age':[25,20],
    'City':['Banglore','Allahabad']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  salman   25   Banglore
1  akhtar   20  Allahabad
<class 'pandas.core.frame.DataFrame'>

In [12]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'salman','Age':25,'City':'Bangalore'},
    {'Name':'shadan','Age':16,'City':'Allahabad'},
    {'Name':'imran','Age':20,'City':'Allahabad'},
    {'Name':'numa','Age':29,'City':'Allahabad'}
]

df=pd.DataFrame(data)
print(df)

     Name  Age       City
0  salman   25  Bangalore
1  shadan   16  Allahabad
2   imran   20  Allahabad
3    numa   29  Allahabad

In [10]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [11]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [19]:
df

     Name  Age       City
0  salman   25  Bangalore
1  shadan   16  Allahabad
2   imran   20  Allahabad
3    numa   29  Allahabad

In [14]:
df['Name']

0    salman
1    shadan
2     imran
3      numa
Name: Name, dtype: object

In [15]:
df.loc[0]

Name       salman
Age            25
City    Bangalore
Name: 0, dtype: object

In [16]:
df.iloc[0]

Name       salman
Age            25
City    Bangalore
Name: 0, dtype: object

In [21]:
print(df.at[2,'Age'])

20

In [23]:
print(df.iat[2,2])

Allahabad

In [24]:
df

     Name  Age       City
0  salman   25  Bangalore
1  shadan   16  Allahabad
2   imran   20  Allahabad
3    numa   29  Allahabad

In [25]:
df['Salary']=[2000,3000,40000,50000]

In [26]:
df

     Name  Age       City  Salary
0  salman   25  Bangalore    2000
1  shadan   16  Allahabad    3000
2   imran   20  Allahabad   40000
3    numa   29  Allahabad   50000

In [27]:
df.drop('Salary',axis=1,inplace=True)

In [28]:
df

     Name  Age       City
0  salman   25  Bangalore
1  shadan   16  Allahabad
2   imran   20  Allahabad
3    numa   29  Allahabad

In [29]:
df['Age']=df['Age']+1

In [30]:
df

     Name  Age       City
0  salman   26  Bangalore
1  shadan   17  Allahabad
2   imran   21  Allahabad
3    numa   30  Allahabad

In [31]:
df.drop(0,inplace=True)

In [32]:
df=pd.read_csv('sales_data.csv')

In [33]:
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [35]:
print(df.dtypes)

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [37]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000